export type Device = { kind: string; name: string };
export const devices: Device[] = [
  { kind: '电脑', name: '机械革命 Yaoshi15Pro Series（GM5PQ0A）' },
  { kind: '平板', name: 'Mi Pad 6 Pro' },
  { kind: '阅读器', name: 'Kindle KWP3' },
  { kind: '手机', name: 'iPhone 7s' },
  { kind: '手机', name: 'Redmi Turbo 4 Pro' },
  { kind: '手机', name: 'HONOR 9X Pro' },
  { kind: '穿戴', name: 'HUAWEI Band 9' },
];

export type Rated = { title: string; id: number; score: number };
const r = (s: string): Rated[] =>
  s.trim().split('\n').map((l) => {
    const [title, id, score] = l.split('|');
    return { title, id: +id, score: +score };
  });

export const anime = r(`
葬送的芙莉莲|400602|9
来自深渊 烈日的黄金乡|298477|9
淡岛百景|493724|9
天元突破 红莲螺岩|770|9
BanG Dream! It's MyGO!!!!!|428735|8
不吉波普不笑|240039|8
我的三体 章北海传|246001|8
药屋少女的呢喃 第二季|486347|8
少女乐队的呐喊|431767|8
疯狂动物城|133860|8
剧场版 少女☆歌剧 Revue Starlight|294135|8
吹响吧！上低音号 第二季|152091|8
莉兹与青鸟|216371|8
浪客剑心 追忆篇|1728|8
进击的巨人 第三季 Part.2|263750|8
吹响吧！上低音号|115908|8
四月是你的谎言|100444|8
夏日幽灵|328674|8
游戏人生 零|187276|8
金牌得主|430699|8
重启咲良田|193378|8
3月的狮子 第二季|211567|8
罗小黑战记2|442114|8
漂流少年|332649|8
蓝色巨星|353792|8
千年女优|840|8
剧场版 链锯人 蕾塞篇|470660|8
奇诺之旅|211068|8
蓦然回首|480441|8
来自新世界|37785|8
千与千寻|311|8
辉夜姬物语|56847|8
平家物语|348335|8
异国日记|493016|8
蓝色恐惧|839|8
哆啦A梦：大雄的绘画奇遇记|515422|8
RE:cycle of the PENGUINDRUM [后篇] 我爱你|379789|8
Fate/Zero|10639|8
朝花夕誓——于离别之朝束起约定之花|218971|8
航海王：粉丝来信|518519|8
`);

export const books = r(`
雪国|366887|7
白夜行|6686|8
局外人|136481|7
伊豆的舞女|296767|0
来自新世界|37782|8
杀戮轮回|19138|5
追寻彗星的吸血鬼|501894|7
少女☆歌剧 Revue Starlight 序曲|236900|6
完美谎言的最后一句话|209722|6
通往夏天的隧道，再见的出口|289878|5
少女终末旅行|128202|7
冰菓|27902|0
宫泽贤治全集 第三卷|9706|0
我想吃掉你的胰脏|141797|7
你名字的侧面|354752|8
再见绘梨|377599|7
末日时在做什么？有没有空？可以来拯救吗？|140678|0
人类衰退之后|11236|8
昨日寻找星星的借口|309637|7
宝贝，早安|166168|7
夏天、烟火、我的尸体|1722|4
重启咲良田|14477|10
要知道有人爱着你呀|380289|7
蓦然回首|342254|7
阶梯岛系列|148819|7
链锯人|268279|6
`);

export const games = r(`
江山北望|587112|0
OPUS：心相吾山|414509|0
OPUS：龙脉常歌 -最终版-|623170|7
魔法使之夜|540053|9
星之终途后日谈：渺茫希望的日记|495135|8
星之终途|317675|7
`);

export const albums = r(`
魔法使之夜 OST|36140|9
いつだって。|11349|6
六等星の夜/悲しみはオーロラに/TWINKLE TWINKLE LITTLE STAR|22843|6
ninelie|174061|0
勇者|457254|0
UNDEAD|501797|0
サマーゴースト オリジナルサウンドトラックCD|365650|0
Avid / Hands Up to the Sky|331899|0
86―エイティシックス― オリジナル・サウンドトラック|333024|0
棘アリ|484421|7
空白とカタルシス|499231|0
熙熙攘攘、我们的城市|488829|0
人类衰退之后 原声|49002|0
`);

export const bgmUser = 'https://bgm.tv/user/xihale';
export const bgm = (id: number) => `https://bgm.tv/subject/${id}`;
